import { IconFast, IconMoney, IconVerified } from "@/components/icons/page";
import React from "react";

export default function About() {
  return (
    <>
      <div className="relative w-screen aspect-[3/1] rounded-b-3xl overflow-hidden">
        <div className="absolute top-0 left-0 z-10 flex items-center justify-center size-full bg-gradient-to-r from-blue-900/90 via-black/70 to-red-800/90">
          <h1 className="relative z-20 text-5xl font-bold text-white">
            Бидний тухай
          </h1>
        </div>

        <img
          src="https://dev242.kodesolution.com/transfox/wp-content/uploads/2024/07/bg-project-3.jpg"
          alt=""
          className="object-cover size-full"
        />
      </div>

      <div className="mx-auto max-w-7xl">
        <div className="relative z-10 grid grid-cols-3 gap-6 mx-auto mb-20 -mt-10">
          <div
            className="flex flex-col items-center p-6 text-center bg-white rounded-xl "
            style={{
              boxShadow: "0 0 30px rgba(0,0,0,.1)",
            }}
          >
            <div className="p-2 bg-red-600 rounded-full">
              <IconMoney className="w-10 h-10 rounded-full fill-white" />
            </div>
            <h1 className="mt-1 text-xl font-bold text-red-600">Хямд үнэ</h1>
            <p className="mt-3 text-sm text-slate-500">
              Манай компани нь үйлчлүүлэгчидээ үргэлж бусдаас хямд үнэ санал
              болгодог
            </p>
          </div>
          <div
            className="flex flex-col items-center p-6 text-center bg-white rounded-xl"
            style={{
              boxShadow: "0 0 30px rgba(0,0,0,.1)",
            }}
          >
            <div className="p-2 bg-red-600 rounded-full">
              <IconFast className="w-10 h-10 rounded-full fill-white" />
            </div>
            <h1 className="mt-1 text-xl font-bold text-red-600"> Хурдан </h1>
            <p className="mt-3 text-sm text-slate-500">
              Бидний үйлчилгээг секундээр хэмж
            </p>
          </div>
          <div
            className="flex flex-col items-center p-6 text-center bg-white rounded-xl"
            style={{
              boxShadow: "0 0 30px rgba(0,0,0,.1)",
            }}
          >
            <div className="p-2 bg-red-600 rounded-full">
              <IconVerified className="w-10 h-10 rounded-full fill-white" />
            </div>
            <h1 className="mt-1 text-xl font-bold text-red-600">Баталгаатай</h1>
            <p className="mt-3 text-sm text-slate-500">
              Тээвэрлэлтийн баталгаагаар таны сэтгэл ханамжийг бид тогтооно.
            </p>
          </div>
        </div>
        <div className="grid items-center w-full grid-cols-2 gap-32">
          <div className="relative w-full ">
            <img
              src="https://smekwt.net/wp-content/uploads/2023/10/logistic.jpg"
              alt=""
              className="object-cover aspect-[1/1] w-full overflow-hidden rounded-3xl"
            />
            <img
              src="https://smekwt.net/wp-content/uploads/2023/10/logistic.jpg"
              alt=""
              className="absolute top-20 -right-10 object-cover aspect-[1/1] w-1/2 ring-8 ring-white ring-r-0 overflow-hidden rounded-2xl"
            />
            <div className="absolute bg-red-600 -right-10 -bottom-16  aspect-[5/4] w-1/2  flex flex-col items-center justify-center ring-8 text-center text-white ring-red-600 ring-r-0 overflow-hidden rounded-xl">
              <svg
                id="fi_11478510"
                viewBox="0 0 32 32"
                className="w-16 h-16 fill-white "
                xmlns="http://www.w3.org/2000/svg"
              >
                <g fill-rule="evenodd">
                  <path d="m27.746582 15.5068359c-.2719727.0458984-.4555664.3037109-.409668.5761719.1083984.640625.1630859 1.2851562.1630859 1.9169922 0 3.524231-1.5708008 6.7053223-4.1016846 8.8234253-.4420166-2.8699341-2.4796143-5.1717529-5.1853638-5.9954834 1.0757446-.7175903 1.7870483-1.9402466 1.7870483-3.3279419 0-2.2060547-1.7944336-4-4-4s-4 1.7939453-4 4c0 1.3876953.7113037 2.6103516 1.7870483 3.3279419-2.7057495.8237305-4.7433472 3.1255493-5.1853638 5.9954834-2.5308838-2.118103-4.1016846-5.2991943-4.1016846-8.8234253 0-.6318359.0546875-1.2763672.1630859-1.9169922.0458984-.2724609-.1376953-.5302734-.409668-.5761719-.2783203-.046875-.5302734.1376953-.5766602.4101562-.1171875.6943359-.1767578 1.3955078-.1767578 2.0830078 0 6.140625 4.3857422 11.3232422 10.4282227 12.3232422.0273438.0048828.0551758.0068359.0820312.0068359.2402344 0 .4521484-.1738281.4926758-.4179688.0454102-.2724609-.1391602-.5302734-.4116211-.5751953-1.6848755-.2788696-3.2262573-.9158936-4.5610962-1.819519.2412109-3.3931885 3.0299072-6.017395 6.4697876-6.017395s6.2285767 2.6242065 6.4697876 6.017395c-1.3348389.9036255-2.8762207 1.5406494-4.5610962 1.819519-.2724609.0449219-.4570312.3027344-.4116211.5751953.0405273.2441406.2524414.4179688.4926758.4179688.0268555 0 .0546875-.0019531.0820312-.0068359 6.0424805-1 10.4282227-6.1826172 10.4282227-12.3232422 0-.6875-.0595703-1.3886719-.1767578-2.0830078-.0463867-.2724609-.3012695-.4580078-.5766602-.4101562zm-14.746582 1.9931641c0-1.6542969 1.3457031-3 3-3s3 1.3457031 3 3-1.3457031 3-3 3-3-1.3457031-3-3z"></path>
                  <path d="m21.4755859 5.4785156c-.059082-.1816406-.215332-.3134766-.4038086-.3408203l-3.1948242-.4638672-1.4287109-2.8955078c-.1679688-.3398438-.7285156-.3398438-.8964844 0l-1.4287109 2.8955078-3.1948242.4638672c-.1884766.0273438-.3447266.1591797-.4038086.3408203-.0585938.1806641-.0097656.3798828.1264648.5126953l2.3120117 2.2529297-.5458984 3.1816406c-.0322266.1884766.0449219.3779297.1987305.4892578.1547852.1123047.3583984.1289062.5268555.0380859l2.8574219-1.5029297 2.8574219 1.5029297c.0732422.0390625.1533203.0576172.2329102.0576172.1035156 0 .206543-.0322266.2939453-.0957031.1538086-.1113281.230957-.3007812.1987305-.4892578l-.5458984-3.1816406 2.3120117-2.2529297c.1362305-.1328125.1850586-.3320312.1264648-.5126953zm-3.324707 2.2324219c-.1176758.1152344-.1713867.2802734-.1435547.4433594l.4189453 2.4423828-2.1933594-1.1533203c-.0732422-.0380859-.152832-.0576172-.2329102-.0576172s-.159668.0195312-.2329102.0576172l-2.1933594 1.1533203.4189453-2.4423828c.027832-.1630859-.0258789-.328125-.1435547-.4433594l-1.7744141-1.7285156 2.4521484-.3564453c.1630859-.0244141.3037109-.1259766.3764648-.2734375l1.0966797-2.2226562 1.0966797 2.2226562c.0727539.1474609.2133789.2490234.3764648.2734375l2.4521484.3564453-1.7744141 1.7285156z"></path>
                  <path d="m4.0351562 13.5234375c-.0322266.1884766.0449219.3779297.1987305.4892578.1552734.1123047.359375.1279297.5268555.0380859l2.2392578-1.1777344 2.2392578 1.1777344c.0732422.0390625.1533203.0576172.2329102.0576172.1035156 0 .206543-.0322266.2939453-.0957031.1538086-.1113281.230957-.3007812.1987305-.4892578l-.4277344-2.4931641 1.8120117-1.765625c.1362305-.1328125.1850586-.3320312.1264648-.5126953-.059082-.1816406-.215332-.3134766-.4038086-.3408203l-2.5039062-.3632812-1.1196289-2.2695312c-.1679688-.3398438-.7285156-.3398438-.8964844 0l-1.1196289 2.2695312-2.5039062.3632812c-.1884766.0273438-.3447266.1591797-.4038086.3408203-.0585938.1806641-.0097656.3798828.1264648.5126953l1.8120117 1.765625zm.0395508-4.2675781 1.7612305-.2558594c.1630859-.0244141.3037109-.1259766.3764648-.2734375l.7875977-1.5966797.7875977 1.5966797c.0727539.1474609.2133789.2490234.3764648.2734375l1.7612305.2558594-1.2744141 1.2412109c-.1176758.1152344-.1713867.2802734-.1435547.4433594l.3007812 1.7539062-1.5751953-.828125c-.0732422-.0380859-.152832-.0576172-.2329102-.0576172s-.159668.0195312-.2329102.0576172l-1.5751953.828125.3007812-1.7539062c.027832-.1630859-.0258789-.328125-.1435547-.4433594l-1.2744141-1.2412109z"></path>
                  <path d="m29.0717773 8.4111328-2.5039062-.3632812-1.1196289-2.2695312c-.1679688-.3398438-.7285156-.3398438-.8964844 0l-1.1196289 2.2695312-2.5039062.3632812c-.1884766.0273438-.3447266.1591797-.4038086.3408203-.0585938.1806641-.0097656.3798828.1264648.5126953l1.8120117 1.765625-.4277344 2.4931641c-.0322266.1884766.0449219.3779297.1987305.4892578.1547852.1123047.3583984.1279297.5268555.0380859l2.2392578-1.1777344 2.2392578 1.1777344c.0732422.0390625.1533203.0576172.2329102.0576172.1035156 0 .206543-.0322266.2939453-.0957031.1538086-.1113281.230957-.3007812.1987305-.4892578l-.4277344-2.4931641 1.8120117-1.765625c.1362305-.1328125.1850586-.3320312.1264648-.5126953-.059082-.1816406-.215332-.3134766-.4038086-.3408203zm-2.4208984 2.0859375c-.1176758.1152344-.1713867.2802734-.1435547.4433594l.3007812 1.7539062-1.5751953-.828125c-.0732422-.0380859-.152832-.0576172-.2329102-.0576172s-.159668.0195312-.2329102.0576172l-1.5751953.828125.3007812-1.7539062c.027832-.1630859-.0258789-.328125-.1435547-.4433594l-1.2744141-1.2412109 1.7612305-.2558594c.1630859-.0244141.3037109-.1259766.3764648-.2734375l.7875977-1.5966797.7875977 1.5966797c.0727539.1474609.2133789.2490234.3764648.2734375l1.7612305.2558594-1.2744141 1.2412109z"></path>
                </g>
                <circle cx="16" cy="30" r=".5"></circle>
              </svg>
              <h1 className="mt-6 mb-2 text-5xl font-bold">20+</h1>
              <p className="font-semibold">Жилийн туршлага</p>
            </div>
          </div>
          <div className="flex flex-col">
            <span className="text-xs font-bold text-red-500 uppercase">
              // Бид хэн бэ
            </span>
            <h1 className="mt-2 mb-10 text-5xl font-semibold">Бидний тухай</h1>
            <p className="text-sm leading-7 text-slate-700">
              “Эй Си Даблью Транс” ХХК нь 2000онд анх байгуулагдсан бөгөөд
              тээвэр зуучлалын салбарт үйл ажиллагаагаа тогтвор суурьшилтай
              эрхлэж байгаа шилдэг компаниудын нэг юм. <br /> Манай компани нь
              Монголын Тээвэр Зуучлагчдын Нэгдсэн Холбооны удирдах зөвлөлийн
              гишүүн, Үндэсний Тээврийн Корпорацийн удирдах зөвлөлийн гишүүн,
              Худалдаа аж үйлдвэрийн танхимын АЛТАН гишүүн бөгөөд бүх үйл
              ажиллагаагаа{" "}
              <span className="font-semibold text-red-600">
                олон улсын стандартын дагуу
              </span>{" "}
              үзүүлдэг. Компанийн тээвэр зуучлалын үйлчилгээг цогцоор үзүүлж
              ирсэн туршлагатай, тус салбарт он удаан жил ажиллаж ирсэн
              чадварлаг боловсон хүчнүүд таны хүссэн бараа бүтээгдэхүүнийг{" "}
              <span className="font-semibold text-red-600">
                хурдан, шуурхай найдвартай тээвэрлэж, шаардлагатай мэдээ,
                мэдээллээр хангаж ажиллах
              </span>{" "}
              болно. Харилцагч, үйлчлүүлэгчидийнхээ сэтгэл ханамжийгэн түрүүнд
              эрхэмлэдэг манай компани дэлхийн бүх боомт, өртөөнүүдэд байрлах
              агентуудтай нягт хамтран ажилладаг тул таны ачааг хүссэн газар
              бүрээс тань тээвэрлэж, чухал шаардлагатай бусад тээврийн
              үйлчилгээг цогцоор нь үзүүлэх болно.
            </p>
          </div>
        </div>
      </div>
    </>
  );
}
